erp3l/src/Enums/ТипыЭтаповУниверсальныхПроцессов/ТипыЭтаповУниверсальныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭтаповУниверсальныхПроцессов</name>
  <enumValues>
    <name>ЭтапСогласования</name>
  </enumValues>
  <enumValues>
    <name>ЭтапПроцессаПодготовкиОтчетности</name>
  </enumValues>
  <enumValues>
    <name>УсловныйПереход</name>
  </enumValues>
  <enumValues>
    <name>Автоутверждение</name>
  </enumValues>
  <enumValues>
    <name>Автоотклонение</name>
  </enumValues>
  <enumValues>
    <name>ДочернийМаршрут</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>ЦиклПока</name>
  </enumValues>
  <enumValues>
    <name>ЭтапУниверсальногоИмпорта</name>
  </enumValues>
  <enumValues>
    <name>ЭтапУниверсальногоЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>Пауза</name>
  </enumValues>
  <enumValues>
    <name>РучнойПереход</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ЭтапыУниверсальныхПроцессов/ЭтапыУниверсальныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыУниверсальныхПроцессов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ШаблоныУниверсальныхПроцессов</owners>
  <attributes>
    <name>УсловияСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДочернийМаршрут</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДочернимМаршрутом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйПереход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеСогласованиеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеОтклонениеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.ТипыЭтаповУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>УтверждающиеИмеютПравоРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОрганизацийЭтапа</name>
    <type>
      <types>EnumRef.ТипыОрганизационныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийУтвержденияЭтапа</name>
    <type>
      <types>EnumRef.КритерииУтвержденияЭтапаПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласованияОбъекта</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СтатусыПоказателей</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СтатусыТранзакций</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
      <types>EnumRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизационныеЕдиницыОтбор_</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУтверждениеЭтапа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаДоступностиРеквизитов</name>
    <type>
      <types>CatalogRef.СхемаДоступностиРеквизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автоутверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НайденыОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиеДействия</name>
    <type>
      <types>EnumRef.АвтоматическиеДействияЭтапаПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеАвтоматическогоВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПоРасписанию</name>
    <type>
      <types>EnumRef.ДействияЭтапаПоРасписанию</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйКомментарийПриСогласовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйКомментарийПриОтклонении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПараметры</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияУсловийОтборов</name>
    <attributes>
      <name>ЗначениеУсловия</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормируемыеДокументы</name>
    <attributes>
      <name>ДокументБД</name>
      <type>
        <types>CatalogRef.ДокументыБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>DefinedType.ШаблонДокументаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьМногопоточность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОбязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрольный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументовЭтапа</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПредшественники</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Утверждающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РасширеннаяАдресацияСогласования</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАдресации</name>
      <type>
        <types>EnumRef.СпособыАдресацииСогласования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыДляОтклонения</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияПараметров</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потребитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтбораПараметра</name>
      <type>
        <types>String</types>
        <types>EnumRef.СпособыВычисленияПараметровОперандов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметраДоТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеСписка</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникСсылка</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/CommonModules/МодульОбработкиЭтаповПроцессовКлиентУХ/Module.bsl
Процедура ОбработатьДокументыЭтапа(СтруктураПараметров) Экспорт
	
	ЭтапПроцесса=СтруктураПараметров.ТекущийЭтап;
	ДокументУправленияПериодом=СтруктураПараметров.ДокументУправленияПериодом;
	
	АдресХранилища = Неопределено;
	ФормаОтчета  = ПолучитьФорму("ОбщаяФорма.ФормаОрганизацийЭтапа",Новый Структура("ЭтапПроцесса,Действие,АдресХранилища",ЭтапПроцесса, Нстр("ru = 'Выполнить этап'")));
	ФормаОтчета.ОткрытьМодально();
	
	
	МодульОбработкиЭтаповПроцессовСерверУХ.ОбработатьДокументыЭтапаСервер(ДокументУправленияПериодом,ЭтапПроцесса)
	
КонецПроцедуры	

Функция ПолучитьОрганизацииЭтапа(ЭтапПроцесса)

		//ОрганизацииЭтапа = ОбработкаОбъект.СостоянияВыполненияПроцесса.Выгрузить(Новый Структура("Этап",Этап),"Организация");
		//АдресТЗОрганизаций =  ПоместитьВоВременноеХранилище(ОрганизацииЭтапа,Новый УникальныйИдентификатор());
		//Возврат АдресТЗОрганизаций;
		//	
			   
КонецФункции

Процедура СогласоватьЭтап(СтруктураПараметров) Экспорт
	
	СогласовываемыйДокумент = СтруктураПараметров.СогласуемыйОбъект;
	ОткрытьФорму("ОбщаяФорма.КомментарийИСогласование", Новый Структура("СогласовываемыйДокумент", СогласовываемыйДокумент),);
	
КонецПроцедуры

Процедура СоздатьОповещение(СтруктураПараметров)
	
	МодульОбработкиЭтаповПроцессовСерверУХ.ОбработатьЭтапОповещения(СтруктураПараметров);
	
КонецПроцедуры

Процедура ВвестиЗаявкуНаЦНСИ(СтруктураПараметров) Экспорт

	  СогласовываемыйДокумент = СтруктураПараметров.СогласуемыйОбъект;
	  ТекЗаявка =  ДействияСогласованиеУХСервер.ПолучитьЗаявкуНСИИзменение(СогласовываемыйДокумент);
	  //ПроцессЗапущен = МодульУправленияПроцессамиУХ.ПроверитьПроцессИнициализирован(ТекЗаявка,);	
	  //МодульУправленияПроцессамиУХ.ИнициализироватьПроцесс(СтруктураПараметров.ДочернийПроцесс,,ТекЗаявка,,СтруктураПараметров.ТекущийЭтап);
	                                   
КонецПроцедуры

Процедура ОбработатьЭтап(СтруктураПараметров,ТекстПроцедуры) Экспорт
	
	Попытка
		//Выполнить(ТекстПроцедуры);
		Если СтруктураПараметров.ТипЭтапа = ПредопределенноеЗначение("Перечисление.ТипыЭтаповУниверсальныхПроцессов.ЦиклПока") Тогда 
			МодульУправленияПроцессамиУХ.УтвердитьЭтапПроцесса(СтруктураПараметров.ЭкземплярПроцесса, , СтруктураПараметров.ТекущийЭтап, НСтр("ru = 'Автоматическое утверждение этапа по завершении интервала согласования'"));
		Иначе	
			МодульУправленияПроцессамиУХ.ИнициироватьСогласованиеЭтапа(СтруктураПараметров.ЭкземплярПроцесса, Неопределено, СтруктураПараметров.ТекущийЭтап, );
		КонецЕсли;
	Исключение
		Сообщить(НСтр("ru = 'Выполнение прервано'"));
		Сообщить(ОписаниеОшибки());
		МодульУправленияПроцессамиУХ.УстановитьСостояниеТекущегоЭтапаЗавершенСОшибкой(СтруктураПараметров.ТекущийЭтап,СтруктураПараметров.ЭкземплярПроцесса);
		
	КонецПопытки;

КонецПроцедуры

// Процедура открывает запрос выбора действий над шаблоном - открыть карточку шаблона ("Реквизиты процесса"),
// сетевую диаграмму ("Конструктор процесса"), или же список этапов ("Этапы процесса"). Список выводится в виде меню.
//
// Параметры:
//  Форма		 - УправляемаяФорма	 - Форма, в которой выводится меню
//  ШаблонСсылка - СправочникСсылка.ШаблоныУниверсальныхПроцессов	 - Ссылка на шаблон процесса
//  СтандартнаяОбработка - Булево	 - Признак стандартной обработки события, из которого вызывается данный метод.
Процедура ДиалогВыбораДействийНадШаблономПроцесса(Форма, ШаблонСсылка, СтандартнаяОбработка = Неопределено) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(0, НСтр("ru = 'Реквизиты процесса'"));
	СписокЗначений.Добавить(1, НСтр("ru = 'Конструктор процесса'"));
	СписокЗначений.Добавить(2, НСтр("ru = 'Этапы процесса'"));
	Ответ = Форма.ВыбратьИзМеню(СписокЗначений);
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = 0 Тогда
		ОткрытьФорму("Справочник.ШаблоныУниверсальныхПроцессов.ФормаОбъекта", Новый Структура("Ключ", ШаблонСсылка));
	ИначеЕсли Ответ.Значение = 1 Тогда
		ОткрытьФорму("Отчет.СетеваяДиаграммаШаблонаУниверсальногоПроцесса.ФормаОбъекта", Новый Структура("ШаблонПроцесса", ШаблонСсылка));
	Иначе 	
		ОткрытьФорму("Справочник.ЭтапыУниверсальныхПроцессов.ФормаСписка", Новый Структура("Отбор", Новый Структура("Владелец", ШаблонСсылка)));
	КонецЕсли;

	
КонецПроцедуры
